---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeRoofProjectedArea(Autodesk.Revit.DB.Element)
source: html/52165199-b609-88c3-9cdb-2e010ad690d2.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeRoofProjectedArea Method

Returns the projected area of the room, unscaled.

## Syntax (C#)
```csharp
public static double ComputeRoofProjectedArea(
	Element pElem
)
```

## Parameters
- **pElem** (`Autodesk.Revit.DB.Element`) - The roof.

## Returns
The projected area.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null